# WHATEVER IDK

In [64]:
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

import plotly.express as px

## Loading and cleaning the dataset

In [65]:
df = pd.read_csv('./data/CompleteResponses.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9898 entries, 0 to 9897
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   salary   9898 non-null   float64
 1   age      9898 non-null   int64
 2   elevel   9898 non-null   int64
 3   car      9898 non-null   int64
 4   zipcode  9898 non-null   int64
 5   credit   9898 non-null   float64
 6   brand    9898 non-null   int64
dtypes: float64(2), int64(5)
memory usage: 541.4 KB

Overall, the dataset is cleaned (in the integer form with categorical variables) and there is no null record in all of the columns.

In [66]:
# create and mutate a categorical dataframe 

## 
df_cat = df.copy()

#Education level
df_cat["elevel"] = df_cat["elevel"].replace({
                                                0: "Less than High School Degree",
                                                1: "High School Degree",
                                                2: "Some College",
                                                3: "4-Year College Degree",
                                                4: "Master's, Doctoral or Professional Degree"
                                            })

#Car category
df_cat["car"] = df_cat["car"].replace({
                                            1: "BMW",
                                            2: "Buick",
                                            3: "Cadillac",
                                            4: "Chevrolet",
                                            5: "Chrysler",
                                            6: "Dodge",
                                            7: "Ford",
                                            8: "Honda",
                                            9: "Hyundai",
                                            10: "Jeep",
                                            11: "Kia", 
                                            12: "Lincoln",
                                            13: "Mazda",
                                            14: "Mercedes Benz",
                                            15: "Mitsubishi",
                                            16: "Nissan",
                                            17: "Ram",
                                            18: "Subaru",
                                            19: "Toyota",
                                            20: "None"        
                                        })

#Zip code
df_cat["zipcode"] = df_cat["zipcode"].replace({
                                                    0: "New England",
                                                    1: "Mid-Alantic",
                                                    2: "East North Central",
                                                    3: "West North Central",
                                                    4: "South Atlantic",
                                                    5: "East South Central",
                                                    6: "West South Central",
                                                    7: "Mountain",
                                                    8: "Pacific"                                                
                                                })


#Brand category
df_cat["brand"] = df_cat["brand"].replace({
                                                0: "Acer",
                                                1: "Sony"
                                            })
         
df_cat

,salary,age,elevel,car,zipcode,credit,brand
0,119806.54480,45,Less than High School Degree,Mercedes Benz,South Atlantic,442037.71130,Acer
1,106880.47840,63,High School Degree,Kia,West South Central,45007.17883,Sony
2,78020.75094,23,Less than High School Degree,Mitsubishi,East North Central,48795.32279,Acer
3,63689.93635,51,4-Year College Degree,Dodge,East South Central,40888.87736,Sony
4,50873.61880,20,4-Year College Degree,Mercedes Benz,South Atlantic,352951.49770,Acer
...,...,...,...,...,...,...,...
9893,87580.91422,75,High School Degree,Subaru,Pacific,282511.90950,Sony
9894,129181.38200,75,Some College,Ford,South Atlantic,384871.36390,Sony
9895,97828.08884,66,Some College,Mitsubishi,New England,399446.69620,Sony
9896,20000.00000,24,High School Degree,Mercedes Benz,Mid-Alantic,223204.64950,Sony
9897,96430.16419,34,High School Degree,Buick,Mountain,224029.80700,Acer

## Data summarization

In [67]:
#dataset information 
df_cat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9898 entries, 0 to 9897
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   salary   9898 non-null   float64
 1   age      9898 non-null   int64
 2   elevel   9898 non-null   object
 3   car      9898 non-null   object
 4   zipcode  9898 non-null   object
 5   credit   9898 non-null   float64
 6   brand    9898 non-null   object
dtypes: float64(2), int64(1), object(4)
memory usage: 541.4+ KB

In [68]:
#function for data overview
def dataoveriew(df, message):
    print(f'{message}:\n')
    print("Rows:", df.shape[0])
    print("\nNumber of features:", df.shape[1])
    print("\nFeatures:")
    print(df.columns.tolist())
    print("\nMissing values:", df.isnull().sum().values.sum())
    print("\nUnique values:")
    print(df.nunique())

dataoveriew(df_cat, "Market research data overview")

Market research data overview:

Rows: 9898

Number of features: 7

Features:
['salary', 'age', 'elevel', 'car', 'zipcode', 'credit', 'brand']

Missing values: 0

Unique values:
salary     9656
age          61
elevel        5
car          20
zipcode       9
credit     9652
brand         2
dtype: int64

Overall, from the overview function, we can see that:
- After cleaning the dataset, there would be 4 categorical features (`elevel`, `car`, `zipcode/place`, `brand`) and 3 numerical columns (`salary`, `age`, `credit`).
- There is no missing value after cleaning the original dataset.
- These are the number of unique values from each column in the post-cleaning dataframe above.

### Summarize the categorical columns

In [69]:
#Function to overview the categorical data

def cat_summarize(df, column):
    print(f'Summarizing the {column} column:\n')
    print('Number of unique values: ', df[column].nunique())
    print(df_cat[column].value_counts())

In [70]:
# Education level summary
cat_summarize(df_cat, "elevel")

Summarizing the elevel column:

Number of unique values:  5
Less than High School Degree                 2052
Some College                                 1983
Master's, Doctoral or Professional Degree    1968
High School Degree                           1948
4-Year College Degree                        1947
Name: elevel, dtype: int64

In [71]:
cat_summarize(df_cat, "car")

Summarizing the car column:

Number of unique values:  20
Mitsubishi       542
Subaru           524
Honda            511
Buick            509
Ram              508
Chrysler         505
Jeep             500
Lincoln          498
Ford             495
Mercedes Benz    494
BMW              492
Toyota           489
Cadillac         488
Hyundai          487
None             484
Chevrolet        479
Dodge            477
Kia              473
Mazda            473
Nissan           470
Name: car, dtype: int64

In [72]:
cat_summarize(df_cat, "zipcode")

Summarizing the zipcode column:

Number of unique values:  9
West South Central    1155
Pacific               1135
East North Central    1112
East South Central    1108
South Atlantic        1087
New England           1085
Mountain              1083
West North Central    1080
Mid-Alantic           1053
Name: zipcode, dtype: int64

In [73]:
cat_summarize(df_cat, "brand")

Summarizing the brand column:

Number of unique values:  2
Sony    6154
Acer    3744
Name: brand, dtype: int64

### Summarize the numerical columnns

In [74]:
def num_summarize(df, column):
    print(f"Sumamrize the {column} column: \n")
    print("Max: ", df[column].max())
    print("Min: ", df[column].min())
    print("Standard deviation: ", df[column].std())
    print('25% quantile: ', df[column].quantile(q=0.25))
    print("Mean (50% quantile): ", df[column].mean())
    print('75% quantile: ', df[column].quantile(q=0.75))

In [75]:
#Age summary
num_summarize(df_cat, "age")

Sumamrize the age column:

Max:  80
Min:  20
Standard deviation:  17.59668510716392
25% quantile:  35.0
Mean (50% quantile):  49.778642149929276
75% quantile:  65.0

In [76]:
#Salary summary
num_summarize(df_cat, "salary")

Sumamrize the salary column:

Max:  150000.0
Min:  20000.0
Standard deviation:  37712.3408360172
25% quantile:  52082.10604
Mean (50% quantile):  84870.8622570186
75% quantile:  117162.043375

In [77]:
#Credit summary
num_summarize(df_cat, "credit")

Sumamrize the credit column:

Max:  500000.0
Min:  0.0
Standard deviation:  145211.57253102225
25% quantile:  120806.81390000001
Mean (50% quantile):  249175.96662033064
75% quantile:  374639.7018

In [78]:
#Correlation between variables in the dataframes
df.corr()

           salary       age    elevel       car   zipcode    credit     brand
salary   1.000000  0.007979 -0.006620 -0.006091 -0.005471 -0.025127  0.206490
age      0.007979  1.000000 -0.005830  0.010246  0.003681 -0.004401  0.013713
elevel  -0.006620 -0.005830  1.000000 -0.000047  0.018095  0.002721 -0.004829
car     -0.006091  0.010246 -0.000047  1.000000  0.001527 -0.010329  0.005923
zipcode -0.005471  0.003681  0.018095  0.001527  1.000000  0.004962  0.004665
credit  -0.025127 -0.004401  0.002721 -0.010329  0.004962  1.000000  0.005688
brand    0.206490  0.013713 -0.004829  0.005923  0.004665  0.005688  1.000000

## Subset observation